test_app/app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "email", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Hector Glover"], ["email", "meu_email-49@email.com"], ["address", "594 Labadie Loop"], ["created_at", "2019-09-30 12:45:51.119142"], ["updated_at", "2019-09-30 12:45:51.119142"]]
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save

UPDATE "customers" SET "name" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["name", "Geraldo Kozey -ATUALIZADO"], ["updated_at", "2019-10-01 14:15:47.306809"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @customer.update(customer_params)