tdd_app/app/controllers/customers_controller.rb

    def create
        @customer = Customer.new(customer_params)

        if @customer.save
---
INSERT INTO "customers" ("name", "email", "smoker", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Jackson"], ["email", "jackson@email.com"], ["smoker", "N"], ["phone", "98989898989"], ["created_at", "2019-09-30 17:01:24.133811"], ["updated_at", "2019-09-30 17:01:24.133811"]]

    def update
        if @customer.update(customer_params)
---
UPDATE "customers" SET "name" = ?, "email" = ?, "smoker" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["name", "Andre"], ["email", "Andre@email.com"], ["smoker", "S"], ["updated_at", "2019-09-30 17:56:13.682816"], ["id", 2]]

    def destroy
        if @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 1]]